Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Gasbetriebene Lötkolben
en: Soldering irons, gas-operated

source: Elektrische Meißel
en: Scissors, electric

source: Elektrische Schermaschinen
en: Electric shearing machines

source: Elektrische Scheren
en: Shears, electric

source: Schmiervorrichtungen [Maschinenteile]
en: Lubricators [parts of machines]

source: Schmierbüchsen [Maschinenteile]
en: Grease boxes [parts of machines]

source: Elektrische Mixer für den Haushalt
en: Electric mixers for household purposes

source: Elektrische Mixgeräte für den Haushalt
en: Blenders, electric, for household purposes

source: Elektrische Lötapparate
en: Soldering apparatus, electric

source: Elektrische Schweißmaschinen
en: Welding machines, electric

source: Elektrische Lötkolben
en: Soldering irons, electric

source: Elektrische Schweißgeräte
en: Electric welding apparatus

source: Mixer [Maschinen]
en: Mixers [machines]

source: Schneepflüge
en: Snow ploughs

source: Filter für Maschinen
en: Filters for machines

source: Elektrische Flaschenzüge
en: Electric pulley blocks

source: Waschmaschinen für Bekleidung
en: Textile washing machines

source: Bohrmaschinen
en: Drilling machines

source: Verkorkmaschinen für Flaschen
en: Bottle stoppering machines

source: Elektrische Fruchtpressen
en: Electric fruit squeezers

source: Elektrische Entsafter
en: Juice extractors, electric

source: Elektrische Fruchtpressen für den Haushalt
en: Fruit presses, electric, for household purposes

source: Antriebsketten, ausgenommen für Landfahrzeuge
en: Transmission chains, other than for land vehicles

source: Treibketten, ausgenommen für Landfahrzeuge
en: Driving chains, other than for land vehicles

source: Elektrische Mixgeräte
en: Electric food blenders

source: Mobile Kräne
en: Mobile cranes

source: Schutzlappen für Maschinen
en: Aprons [parts of machines]

source: Hauben [Maschinenteile]
en: Cowlings [parts of machines]

source: Lager für Maschinen
en: Bearings for machines

source: Antifriktionslager für Maschinen
en: Anti-friction bearings for machines

source: Setzmaschinen [Druckerei]
en: Type-setting machines [printing]

source: Spinnmaschinen
en: Spinning frames

source: Hydraulische Türöffner
en: Door openers, hydraulic

source: Hydraulische Türöffner und -schließer [Maschinenteile]
en: Hydraulic door openers and closers [parts of machines]

source: Sägen [Maschinen]
en: Saws [machines]

source: Bulldozer
en: Bulldozers

source: Roder [Maschinen]
en: Diggers [machines]

source: Farbspritzpistolen [Airbrushpistole]
en: Air brushes for applying colour

source: Motoren für Luftfahrzeuge
en: Aeronautical engines

source: Flugzeugmotoren
en: Aeroplane engines

source: Pressen für Industriemaschinen
en: Industrial machine presses

source: Pressen [Maschinen für gewerbliche Zwecke]
en: Presses [machines for industrial purposes]

source: Pneumatische Türöffner und -schließer [Maschinenteile]
en: Pneumatic door openers and closers [parts of machines]

source: Pneumatische Türöffner
en: Door openers, pneumatic

source: Kompressoren für Maschinen
en: Compressors for machines

source: Kompressoren [Maschinen]
en: Compressors [machines]

source: Druckwalzen [Maschinenteile]
en: Printing rollers for machines

source: Weinpressen
en: Wine presses

source: Werkzeughalter [Maschinenteile]
en: Holding devices for machine tools

source: Motorlager, ausgenommen für Landfahrzeuge
en: Engine mounts, other than for land vehicles

source: Gasturbinen, ausgenommen für Landfahrzeuge
en: Gas turbines not for land vehicles

source: Maschinen zur Herstellung von Teigwaren
en: Edible pastes (Machines for making -)

source: Maschinen zur Düngemittelherstellung
en: Fertilizer manufacturing machines

source: Sortiermaschinen für Teeblätter
en: Tea leaves sorting machines

source: Hydraulikmotoren für Bagger
en: Hydraulic motors for excavators

source: Hydraulikzangen [Teile von Baumaschinen]
en: Hydraulic pliers (parts of constructing machines)

source: Müll- und Abfallfördermaschinen
en: Waste and trash conveying machines

source: Sägebänke als Teile von Maschinen
en: Saw benches being parts of machines

source: Elektrische Küchenmaschinen
en: Kitchen machines, electric

source: Treibstoff- und Luftmischregler als Teile von internen Verbrennungsmotoren
en: Fuel and air mixture regulators being parts of internal combustion engines

source: Maschinen zum Reinigen von Banknoten
en: Machines for banknote cleaning

source: Optische Sortiermaschinen
en: Optical sorting machines

source: Pizzaschneider, elektrisch
en: Electric pizza cutters

source: Fensterputzgeräte, elektrisch
en: Electric window cleaning equipment

source: Dosierpumpen für Benzin
en: Metered gasoline pumps

source: Elektrolysegeräte zum Galvanisieren
en: Electrolysis apparatus for electroplating

source: Drahtbürsten [Maschinenteile]
en: Wire brushes [parts of machines]

source: Ansaugkrümmer für Motoren
en: Intake manifolds for motors

source: Ölkühler für Motoren
en: Oil coolers for motors

source: Steuerketten für Motoren
en: Timing belts for motors

source: Steuerketten für Maschinen
en: Timing belts for machines

source: Drehzahlregler für Maschinen
en: Speed governors for machines

source: Druckmaschinen zum Bedrucken von Keramik
en: Printing machines for use with ceramics

source: Kantenschneider für den Garten
en: Line trimmers for garden use

source: Maschinen zum Zerkleinern von Gartenabfällen
en: Machines for shredding horticultural waste

source: Pneumatische Steuerungen für Motoren
en: Pneumatic controls for motors

source: Pneumatische Steuerungen für Maschinen
en: Pneumatic controls for machines

source: Tragbare Elektrogeneratoren
en: Portable electric power generators

source: Küchenmixer, elektrisch
en: Electric kitchen mixers

source: Pleuelstangen für Landfahrzeugmotoren
en: Connecting rods for land vehicle engines

source: Hydraulische Steuerungen für Motoren
en: Hydraulic controls for motors

source: Hydraulische Steuerungen für Maschinen
en: Hydraulic controls for machines

source: Schleifwerkzeuge [Maschinenteile]
en: Grinding tools [parts of machines]

source: Motoren für Modellschiffe
en: Motors for model boats

source: Motoren für Modellluftfahrzeuge
en: Motors for model aircraft

source: Positive Crankcase Ventilation- [PCV-] Ventile für Motoren
en: Positive crankcase ventilation [PCV] valves for motors and engines

source: Ventile zur Abgasrückführung [AGR] für Motoren
en: Exhaust gas recirculation [EGR] valves for motors and engines

source: Zündverteiler für Fahrzeugmotoren
en: Distributors for vehicle engines

source: Sämaschinen für landwirtschaftliche Maschinen
en: Seed drills for agricultural machines

source: Staubfilter für Staubsauger
en: Dust filters for vacuum cleaners

source: Reinigungsgeräte, elektrisch, für den Haushalt
en: Electric cleaning apparatus for household use

source: Pleuelstangen für Maschinen
en: Connecting rods for machines

source: Mechanische Futterspender für Tiere
en: Mechanized feeders for animals

source: Getriebe für Personenlifte
en: Gears for passenger lifts

source: Mixgeräte, elektrisch, für gewerbliche Zwecke
en: Electric food grinders for industrial use

source: Mixgeräte, elektrisch, für kommerzielle Zwecke
en: Electric food grinders for commercial use

source: Elektropumpen für Schwimmbecken
en: Electric pumps for swimming pools

source: Roboterarme für industrielle Zwecke
en: Robotic arms for industrial purposes

source: Spiralbindemaschinen für industrielle Zwecke
en: Spiral binding machines for industrial use

source: Motorzylinder für Landfahrzeuge
en: Engine cylinders for land vehicles

source: Motorenzylinder für Fahrzeuge
en: Engine cylinders for vehicles

source: Elektrische Wasserpumpen für Bäder
en: Electric water pumps for baths

source: Elektrische Wasserpumpen für Massagebäder
en: Electric water pumps for spa baths

source: Elektrische Wasserpumpen für Schwimmbecken
en: Electric water pumps for swimming pools

source: Wasserpumpen für Sprudelbäder
en: Water pumps for spa baths

source: Wasserpumpen für Wasserfiltereinheiten
en: Water pumps for water filtering units

source: Wasserpumpen für Schwimmbecken
en: Water pumps for swimming pools

source: Wasserpumpen für Bäder
en: Water pumps for baths

source: Bohrer [Elektrowerkzeuge]
en: Drills [power tools]

source: Dosierventile [Maschinenteile]
en: Dosing valves [parts of machines]

source: Ölpumpen für Landfahrzeugmotoren
en: Oil pumps for land vehicle engines

source: Kugellager für Skateboards
en: Ball bearings for skateboards

source: Kugellager für Rollschuhe
en: Ball bearings for roller skates

source: Kugellager für Inlineskates
en: Ball bearings for in-line skates

source: Luftsteine für Aquarien [Pumpen]
en: Aquarium air stones [pumps]

source: Elektronische Steuerungen für Servomotoren
en: Electronic servo motor controllers

source: Elektronische Steuerungen für Motoren
en: Electronic controls for motors

source: Pumpen für Landfahrzeugmotoren
en: Pumps for land vehicle engines

source: Auslass-Rückschlagventile für Luftkompressoren
en: Unloading check valves for the outlets of air compressors

source: Automatische Einlassstellventile für Kolbenkompressoren
en: Automatic inlet control valves for reciprocating air compressors

source: Zerstörer
en: Wreckers

source: Mechanischer Horse Walker
en: Mechanized horse walkers

source: Mechanisch betätigte handgehaltene Bördler
en: Mechanically operated hand-held crimpers

source: Mechanische Teile von Landfahrzeugmotoren
en: Mechanical engine parts for land vehicles

source: Verbrennungsmotoren für die Energieproduktion, nicht für Landfahrzeuge
en: Internal combustion engines for power generation, other than for land vehicles

source: Elektrische Wasserpumpen
en: Electric water pumps

source: Motorblöcke für Automobile
en: Automotive engine blocks

source: Ölwannen für Automobile
en: Automobile oil pans

source: Honmaschinen für die Metallbearbeitung
en: Honing machines for metalworking

source: Elektrische Nagelzieher
en: Nail extractors, electric

source: Elektrische Skikantenschleifer
en: Ski edge sharpening tools, electric

source: Steuerketten für Industriemaschinen
en: Timing belts for industrial motors

source: Dosierventile als Maschinenteile
en: Dispensing valves being machine parts

source: Schubstangen für Motoren
en: Push rods for engines

source: 3D-Druck-Stifte
en: 3D printing pens

source: Land-, garten- und forstwirtschaftliche Maschinen und Apparate
en: Agricultural, gardening and forestry machines and apparatus

source: Saugpumpen
en: Suction pumps

source: Befestigungs- und Verbindungsmaschinen, -geräte und -apparate
en: Machines, tools and apparatus for fastening and joining

source: Lasergravurmaschinen für Holzarbeiten
en: Laser engraving machines for woodworking

source: Gravierapparate für die Herstellung von Anzeigetafeln
en: Etching apparatus for use in manufacturing display panels

source: Ansaugkrümmer für Verbrennungsmotoren
en: Intake manifolds for internal combustion engines

source: Spulen für Nähmaschinen
en: Bobbins for sewing machines

source: Anreißstarter für Motoren, ausgenommen für Fahrzeuge
en: Recoil starters for engines other than for vehicles

source: Lastenaufzüge
en: Service lifts

source: Scharen für Erdbaumaschinen
en: Blades for earth moving machines

source: Autogen-Schneidbrenner
en: Oxyacetylene cutting machines

source: Kurbelgehäuse für Motoren
en: Crankcases for motors

source: Kurbelgehäuse für Maschinen
en: Crankcases for machines

source: Motoren für Luftschiffe
en: Engines for aerostats

source: Ortsfeste Kräne
en: Fixed cranes

source: Gummiketten zur Verwendung als Laufketten an Baumaschinen
en: Rubber tracks for use with crawlers on construction machines

source: Gummiketten zur Verwendung als Laufketten an Maschinen und Apparaten zum Be- und Entladen
en: Rubber tracks for use with crawlers on loading-unloading machines and apparatus

source: Gummiketten zur Verwendung als Laufketten an landwirtschaftlichen Maschinen
en: Rubber tracks for use with crawlers on agricultural machines

source: Gummiketten zur Verwendung Laufketten an Bergbaumaschinen
en: Rubber tracks for use with crawlers on mining machines

source: Gummiketten zur Verwendung als Laufketten an Schneepflügen
en: Rubber tracks for use with crawlers on snow ploughs

source: Laserbohrmaschinen für Steinarbeiten
en: Laser drilling machines for stone working

source: Fräs- und Formmaschinen
en: Shaping and moulding machines

source: Maschinen zum Formen von Holz
en: Machines for shaping wood

source: Maschinen zum Formen von Glas
en: Machines for shaping glass

source: Maschinen zum Formen von Kunststoffmaterialien
en: Machines for shaping plastic material

source: Robotermechaniken zur Holzbearbeitung
en: Robotic mechanisms for working wood

source: Robotermechaniken zur Metallbearbeitung
en: Robotic mechanisms for working metal

source: Robotermechaniken zur Glasbearbeitung
en: Robotic mechanisms for working glass

source: Robotermechaniken zur Kunststoffbearbeitung
en: Robotic mechanisms for working plastic material

source: Robotermechaniken für Hubzwecke
en: Robotic mechanisms for lifting

source: Robotermechaniken zur Förderung
en: Robotic mechanisms for conveying

source: Robotermechaniken zur Beförderung
en: Robotic mechanisms for transportation

source: Maschinen zur Verwendung im Weinbau
en: Machines for use in viticulture

source: Maschinen zur Verarbeitung von Obst
en: Machines for processing fruits

source: Maschinen zur Verarbeitung von Gemüse
en: Machines for processing vegetables

source: Robotermechaniken zur Verwendung im Weinbau
en: Robotic mechanisms used in viticulture

source: Elektrische Lochstanzmaschinen
en: Electric punching machines

source: Pistolen für Druckluftspritzmaschinen
en: Guns for compressed air spraying machines

source: Pistolen für Druckflüssigkeitsspritzmaschinen
en: Guns for compressed liquid spraying machines

source: Automatische Roboterfarbspritzpistolen
en: Automatic robotic spray guns for paint

source: Elektrische Lochstanzroboter
en: Robotic electric punching machines

source: Elektrische Roboterklebepistolen
en: Robotic electric glue guns

source: Bremsbeläge, ausgenommen für Fahrzeuge
en: Brake linings, other than for vehicles

source: Bremsscheiben, ausgenommen für Fahrzeuge
en: Brake pads, other than for vehicles

source: Schaltkupplungen, ausgenommen für Landfahrzeuge
en: Clutches, other than for land vehicles

source: Typografische Pressen
en: Typographic presses

source: Entstaubungsanlagen für Reinigungszwecke
en: Dust removing installations for cleaning purposes

source: Bremsbacken, ausgenommen für Fahrzeuge
en: Brake segments, other than for vehicles

source: Bremsschuhe, ausgenommen für Fahrzeuge
en: Brake shoes, other than for vehicles

source: Stampfer [Maschinen]
en: Rammers [machines]

source: Industrieroboter für die Holzbearbeitung
en: Industrial robots for working wood

source: Industrieroboter für die Metallbearbeitung
en: Industrial robots for working metal

source: Industrieroboter für die Glasbearbeitung
en: Industrial robots for working glass

source: Industrieroboter für die Kunststoffbearbeitung
en: Industrial robots for working plastic material

source: Maschinen zur Modellierung von Kunststoffen
en: Machinery for shaping plastic material

source: Robotermechaniken zur Modellierung von Holz
en: Robotic mechanisms for shaping wood

source: Robotermechaniken zur Modellierung von Glas
en: Robotic mechanisms for shaping glass

source: Robotermechaniken zur Modellierung von Kunststoffen
en: Robotic mechanisms for shaping plastic material

source: Robotermechaniken zur Verwendung in der Getreideverarbeitung
en: Robotic mechanisms for use in processing cereals

source: Robotermechaniken zur Verwendung in der Obstverarbeitung
en: Robotic mechanisms for use in processing fruits

source: Robotermechaniken zur Verwendung in der Gemüseverabeitung
en: Robotic mechanisms for use in processing vegetables

source: Roboterpistolen für Druckluftspritzmaschinen
en: Robotic guns for compressed air spraying machines

source: Robotergesteuerte Druckluftpumpen
en: Robotic compressed air pumps

source: Robotergesteuerte Waschanlagen für Fahrzeuge
en: Robotic vehicle washing installations

source: Reinigungsroboter für Haushaltszwecke
en: Robotic cleaners for household purposes

source: Elektrowerkzeuge zum Formen von Eisskulpturen
en: Power tools for use in ice sculpting

source: Kraftstofffilter für Fahrzeugmotoren
en: Fuel filters for vehicle engines

source: Industrieroboter zum Formen von Holz
en: Industrial robots for shaping wood

source: Industrieroboter zum Formen von Metall
en: Industrial robots for shaping metal

source: Industrieroboter zum Formen von Glas
en: Industrial robots for shaping glass

source: Industrieroboter zur Formen von Kunststoffen
en: Industrial robots for shaping plastic material

source: Elektrische Lichtbogenschneideroboter
en: Robotic electric arc cutting apparatus

source: Zapfpistolen für Treibstoffzapfsäulen
en: Guns for fuel dispensing pumps

source: Elektrische Mühlen für die Küche
en: Kitchen grinders, electric

source: Schalldämpfer für Motoren [Auspuff]
en: Mufflers for motors and engines

source: Auspufftöpfe für Motoren
en: Exhausts for motors and engines

source: Luftpumpen zur Verwendung in Terrarien
en: Air pumps for use in terrariums

source: Wasserpumpen zur Verwendung in Aquarien
en: Water pumps for use in aquariums

source: Wasserpumpen zur Verwendung in Terrarien
en: Water pumps for use in terrariums

source: Elektrische Staubsauger für Bettzeug
en: Electric vacuum cleaners for bedding

source: Maschinen zum Trennen von Rohreis
en: Rough rice separating machines

source: Druckköpfe für Tintenstrahldruckmaschinen
en: Printheads for ink-jet printing machines

source: Unbeheizte Trockenschleudern für Haushaltszwecke
en: Spin dryers for household purposes (not heated)

source: Kompressoren für Wäschetrockner
en: Compressors for clothes dryers

source: Kompressoren für Klimaschränke
en: Compressors for air handlers

source: Kompressoren für Waschmaschinen
en: Compressors for laundry washing machines

source: Maschinen für die Herstellung von elektrischen und elektronischen Schaltkreisen
en: Machines for use in the manufacture of electrical and electronic circuitry

source: Maschinen für die Aufbereitung von Oberflächen für elektrische und elektronische Bauteile
en: Machines for the preparation of surfaces for electrical and electronic components

source: Maschinen zum Tempern von elektrischen und elektronischen Schaltkreisen
en: Machines for annealing electrical and electronic circuitry

source: Kabellose Staubsauger
en: Cordless vacuum cleaners

source: Elektrische Dampfbesen
en: Electric steam mops

source: Räder und Laufketten für Maschinen
en: Wheels and tracks for machines

source: Schneide-, Bohr-, Schleif-, Schärf- und Oberflächenbehandlungsmaschinen und -apparate
en: Cutting, drilling, abrading, sharpening and surface treatment machines and apparatus

source: Motoren, Antriebe, Maschinenteile und Steuerungen für den Betrieb von Maschinen und Motoren
en: Engines, powertrains, and machine parts, and controls for the operation of machines and engines

source: Biegemaschinen für die Metallbearbeitung
en: Bending machines for metalworking

source: Automatische Waschmittelspender
en: Automated laundry detergent dispensers

source: Zuleitungen für Vergaser
en: Feed pipes for carburettors

source: Kurvenrollen [Maschinenteile]
en: Cam rollers [parts of machines]

source: Honigschleudern [Maschinen]
en: Honey extractors (machines)

source: Automatische Bogenkollationiermaschinen
en: Automatic sheet collating machines

source: Seiden-Spinnmaschinen
en: Silk spinning machinery

source: Scheiden für Messer
en: Sheaths for knives

source: Lederfutterale für Messer
en: Leather sheaths for knives

source: Knarrenhebel [handbetätigte Werkzeuge]
en: Ratchet handles [hand-operated tools]

source: Steinhämmer [handbetätigte Werkzeuge]
en: Stone hammers [hand-operated tools]

source: Reibahlen [Handwerkzeuge]
en: Reamers [hand tools]

source: Schlägel [Handwerkzeuge]
en: Mallets [hand instruments]

source: Handbetätigte Rasenmäher
en: Lawn clippers [hand instruments]

source: Handbetätigte Gemüsehackmesser
en: Vegetable choppers (Hand-operated -)

source: Spitzmeißel [Handwerkzeuge]
en: Centre punches [hand tools]

source: Elektrische Nagelfeilen
en: Nail files, electric

source: Handbetätigte Inbuswerkzeuge
en: Nut-tapping tools [hand-operated]

source: Tafelmesser aus Sterlingsilber
en: Sterling silver table knives

source: Scheren [Blech-, Baum-, Gartenscheren]
en: Wiremesh cutters (Hand operated -)

source: Messer
en: Sabres

source: Handbetätigte Fräsen
en: Hand-operated tiller

source: Hebel
en: Levers

source: Spanngeräte [handbetätigte Werkzeuge]
en: Tighteners [hand-operated tools]

source: Fliesenschneider [handbetätigte Werkzeuge]
en: Tile cutters [hand operated tools]

source: Gleitschienenwinkel [handbetätigte Werkzeuge]
en: Sliding squares [hand-operated tools]

source: Bügelsägerahmen für handbetätigte Bügelsägen
en: Hacksaw frames for hand operated hacksaws

source: Schneidscheiben [handbetätigte Werkzeuge]
en: Cutting discs [hand operated tools]

source: Handbetätigte Bohrmaschinen
en: Drill presses (Hand operated -)

source: Scheren
en: Scissors

source: Japanische Scheren [japanische Fadenscheren]
en: Japanese grip scissors [Japanese thread clippers]

source: Heckenschneider [handbetätigte Werkzeuge]
en: Hedge cutters [hand-operated tools]

source: Handbetätigte Honahlen
en: Honing tools [hand-operated]

source: Lochzangen [Handwerkzeuge]
en: Punch pliers [hand tools]

source: Handbetätigte Pistolen zum Spritzen von Spachtelmassen
en: Guns, hand-operated, for the extrusion of mastics

source: Kerbmesser für Furnierblätter
en: Scoring knife for veneer sheets

source: Schraubendrehereinsätze für handbetätigte Schraubendreher
en: Screwdriver bits for hand operated screwdrivers

source: Elektrische Fingernägelpolierer
en: Electric fingernail polishers

source: Geräte und Werkzeuge zum Abbalgen von Tieren
en: Instruments and tools for skinning animals

source: Hobelwerkzeuge [handbetätigt]
en: Planing tools [hand-operated]

source: Saugglocken zum Beseitigen von Rohrverstopfungen [handbetätigte Werkzeuge]
en: Plungers for clearing blockages in pipes [hand-operated tools]

source: Schlangenbohrer für handbetätigte Werkzeuge
en: Auger bits for use with hand-operated tools

source: Handbetätigte Rasierklingenschärfer
en: Manually-operated razor blade sharpeners

source: Handbetätigte Wagenheber
en: Lifting jacks, hand-operated

source: Brecheisen
en: Crow bars

source: Handbetätigte Pumpen für Flüssigkeiten
en: Pumps for liquids [hand-operated]

source: Sicheln [handbetätigte Werkzeuge]
en: Reaping hooks [hand-operated tools]

source: Nicht elektrische Fingernagelpolierer
en: Non-electric fingernail polishers

source: Messer [Handwerkzeuge]
en: Blades [hand tools]

source: Elektrische Barttrimmer
en: Electric beard trimmers

source: Handbetätigte Astscheren
en: Branch cutters [hand-operated]

source: Handbetätigte Rasenvertikutierer
en: Lawn rakes [hand-operated ones only]

source: Rübenschneider [handbetätigte Werkzeuge]
en: Turnip cutters [hand-operated tools]

source: Radschlüssel [handbetätigte Werkzeuge]
en: Tyre removers [hand operated tools]

source: Nicht elektrische flexible Schraubendreher
en: Flexible screwdrivers (Non-electric -)

source: Schleifscheiben [Teile für handbetätigte Werkzeuge]
en: Abrasive discs [parts for hand operated tools]

source: Stemmeisen [Handwerkzeuge]
en: Caulking irons [hand tools]

source: Angepasste Behälter für Rasierklingen
en: Containers adapted for razor blades

source: Nicht elektrische Nagelpoliergeräte
en: Nail polishers (Non-electric -)
